{"tagname":"class","name":"Ext.ux.DataTip","autodetect":null,"files":[{"filename":"C:/Users/Administrator/Desktop/Ext.JS TS Types Generator v1.3.0/tmp/src-ux/DataTip.js","linenr":1}],"doc":"<p>This plugin implements automatic tooltip generation for an arbitrary number of child nodes\n<em>within</em> a Component.</p>\n\n<p>This plugin is applied to a high level Component, which contains repeating elements,\nand depending on the host Component type, it automatically selects\na delegate so that it appears when the mouse enters a sub-element.</p>\n\n<p>When applied to a GridPanel, this ToolTip appears when over a row, and the Record's data\nis applied using this object's tpl template.</p>\n\n<p>When applied to a DataView, this ToolTip appears when over a view node, and the Record's data\nis applied using this object's tpl template.</p>\n\n<p>When applied to a TreePanel, this ToolTip appears when over a tree node, and the Node's\nExt.data.Model record data is applied using this object's tpl template.</p>\n\n<p>When applied to a FormPanel, this ToolTip appears when over a Field, and the Field's <code>tooltip</code>\nproperty is used is applied using this object's tpl template, or if it is a string,\nused as HTML content. If there is no <code>tooltip</code> property, the field itself is used\nas the template's data object.</p>\n\n<p>If more complex logic is needed to determine content, then the beforeshow event\nmay be used. This class also publishes a <strong><code>beforeshowtip</code></strong> event through its host Component.\nThe <em>host Component</em> fires the <strong><code>beforeshowtip</code></strong> event.</p>\n","aliases":{"widget":null,"request":null},"alternateClassNames":[],"extends":"Ext.tip.ToolTip","mixins":[],"requires":[],"uses":[],"singleton":null,"private":null,"enum":null,"members":[],"code_type":"ext_define","id":"class-Ext.ux.DataTip","component":false,"short_doc":"This plugin implements automatic tooltip generation for an arbitrary number of child nodes\nwithin a Component. ...","deprecated":null}